#version: 0.2
c c
) )
C C
)) ))
cc cc
cc c
( =
č Ċ
n c
)))) ))))
N C
CC C
)))) ))
@ @
cccc c
O C
) [
C O
cccc cc
CC CC
C l
C c
C N
] (
) =
CC N
c n
)))))) )
( -
n H
N c
) (
1 0
CC O
)))))))) ))
n cc
)))))))) )
CO c
n n
)))) )
N CC
C NC
c nc
) (=
+ ]
@ ]
1 2
)) )
O CC
C cccc
- ]
C OC
@@ ]
CC CCC
B r
s c
o c
)))))))))) )
CCC N
cccc C
CCO CC
CC NC
O c
cc n
C S
cccc Cl
CC OC
cc nc
C F
N CCC
( [
n nc
C cccccc
CC c
) /
cccc F
N CCCC
2 1
)))))))) ))))
CO cccc
ccc nc
-] )
( /
C n
nc nc
2 3
N S
10 6
6 9
9 6
C ccc
CCCC CCCC
N CCN
N cccc
NC c
cn cc
c C
)))))))) )))))
] [
+] =
CCC NC
n ccc
S C
cccc O
cc ncc
+] (=
CO ccc
cn n
1 3
cc C
N cccccc
] %
cccc nc
CCCC CC
)))))))) ))))))
OC c
OC O
1 4
c s
3 2
CCC O
nc n
CCN CC
-] ))
N ccc
n o
c OC
CO cccccc
cccc n
C ccccc
9 5
c Cl
cn ccc
CCO c
C cc
cccc OC
CC S
ccccc n
N CCOCC
cn nc
NCC NC
CN CC
c F
c O
+ ](
cccc NC
ccc C
Nc nc
)))))))) )))))))
NCC CCC
3 4
N ccccc
N O
n oc
CCCC N
n cccc
)) [
)))))))) ))))))))
ccc ncc
1 1
NC cccccc
c sc
CC n
CO ccccc
O CCO
= [
ccc Cl
cc nn
ccccC F
cn cccccc
ccccc Cl
N N
cc sc
S CC
ccc n
)))))) [
ccc o
CCCC CCC
ccc s
cn cccc
CO CC
cc O
N CCO
O CCN
CC cccccc
CS c
cc OC
cc Cl
CN c
cccc s
Cc nc
ccc F
cc F
cccc o
N CCCN
n cccccc
CCCC NC
CCC c
ccc O
cccc Br
Ccccc C
nn n
cnc nc
OC cccccc
O cccccc
S c
ncc nc
CO ccccC
ccccc C
o n
CN CCC
O cccc
)))))) )[
N NC
4 3
n C
C nc
Cccc C
O CCC
ccccc F
CN CCCC
ccc OC
CN CCN
ccc NC
+] [
ncc n
+]( [
)))))))) )[
)))))))) )))))))))
)) )[
N cncc
1 7
cccc cccc
@] %
NCCCC CC
Ccccc Cl
) -
NCC c
cccc S
)))))))) [
C ncc
N ccccF
( \
@@ ](
CS C
O CCCC
CO CCN
N ccccC
@@] %
cccc ccccc
nccc n
N ccccCl
nc C
@ ](
)))))))) ))))))))))
Ccccc F
CN S
ccccc CF
nc N
NCCC NC
cnc n
CCCC O
CN CCCCC
cnc C
CN CCNC
cn ccn
ccccc NC
CC l
CCC S
1 5
ncc C
Ccccc O
N cnccc
CCC NCC
OC F
CN cccccc
Cc nn
ccccc O
cc oc
/ [
Cl c
c o
CO P
cccc CC
s ccc
cn nn
NCCN CC
)))) [
NCC cccccc
Ccccc NC
cn oc
5 9
F c
CCC cccccc
C ccn
ncc s
- %
)))) )[
Ccccc S
CN CCO
cccc ccc
ccnn C
c N
c oc
]( [
N cn
CCC n
nc ncc
ccc sc
CCO cccccc
)))))))) )))))))))))
O P
cc N
1 8
CCO cccc
COccc C
S Cc
ccc CF
cc CF
O CCCN
cccc cccccc
O S
c CF
COcccc NC
s cc
NCCC O
cccc OCC
o nc
CCC Oc
S i
4 5
ccccOC F
CNC cccccc
Ccccc nc
CCC OC
)) =
-] ,
CCN c
COccc OC
