{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<mask>",
      "single_word": false,
      "lstrip": true,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<s>": 0,
      "</s>": 1,
      "<pad>": 2,
      "<mask>": 3,
      "<unk>": 4,
      "!": 5,
      "\"": 6,
      "#": 7,
      "$": 8,
      "%": 9,
      "&": 10,
      "'": 11,
      "(": 12,
      ")": 13,
      "*": 14,
      "+": 15,
      ",": 16,
      "-": 17,
      ".": 18,
      "/": 19,
      "0": 20,
      "1": 21,
      "2": 22,
      "3": 23,
      "4": 24,
      "5": 25,
      "6": 26,
      "7": 27,
      "8": 28,
      "9": 29,
      ":": 30,
      ";": 31,
      "<": 32,
      "=": 33,
      ">": 34,
      "?": 35,
      "@": 36,
      "A": 37,
      "B": 38,
      "C": 39,
      "D": 40,
      "E": 41,
      "F": 42,
      "G": 43,
      "H": 44,
      "I": 45,
      "J": 46,
      "K": 47,
      "L": 48,
      "M": 49,
      "N": 50,
      "O": 51,
      "P": 52,
      "Q": 53,
      "R": 54,
      "S": 55,
      "T": 56,
      "U": 57,
      "V": 58,
      "W": 59,
      "X": 60,
      "Y": 61,
      "Z": 62,
      "[": 63,
      "\\": 64,
      "]": 65,
      "^": 66,
      "_": 67,
      "`": 68,
      "a": 69,
      "b": 70,
      "c": 71,
      "d": 72,
      "e": 73,
      "f": 74,
      "g": 75,
      "h": 76,
      "i": 77,
      "j": 78,
      "k": 79,
      "l": 80,
      "m": 81,
      "n": 82,
      "o": 83,
      "p": 84,
      "q": 85,
      "r": 86,
      "s": 87,
      "t": 88,
      "u": 89,
      "v": 90,
      "w": 91,
      "x": 92,
      "y": 93,
      "z": 94,
      "{": 95,
      "|": 96,
      "}": 97,
      "~": 98,
      "¡": 99,
      "¢": 100,
      "£": 101,
      "¤": 102,
      "¥": 103,
      "¦": 104,
      "§": 105,
      "¨": 106,
      "©": 107,
      "ª": 108,
      "«": 109,
      "¬": 110,
      "®": 111,
      "¯": 112,
      "°": 113,
      "±": 114,
      "²": 115,
      "³": 116,
      "´": 117,
      "µ": 118,
      "¶": 119,
      "·": 120,
      "¸": 121,
      "¹": 122,
      "º": 123,
      "»": 124,
      "¼": 125,
      "½": 126,
      "¾": 127,
      "¿": 128,
      "À": 129,
      "Á": 130,
      "Â": 131,
      "Ã": 132,
      "Ä": 133,
      "Å": 134,
      "Æ": 135,
      "Ç": 136,
      "È": 137,
      "É": 138,
      "Ê": 139,
      "Ë": 140,
      "Ì": 141,
      "Í": 142,
      "Î": 143,
      "Ï": 144,
      "Ð": 145,
      "Ñ": 146,
      "Ò": 147,
      "Ó": 148,
      "Ô": 149,
      "Õ": 150,
      "Ö": 151,
      "×": 152,
      "Ø": 153,
      "Ù": 154,
      "Ú": 155,
      "Û": 156,
      "Ü": 157,
      "Ý": 158,
      "Þ": 159,
      "ß": 160,
      "à": 161,
      "á": 162,
      "â": 163,
      "ã": 164,
      "ä": 165,
      "å": 166,
      "æ": 167,
      "ç": 168,
      "è": 169,
      "é": 170,
      "ê": 171,
      "ë": 172,
      "ì": 173,
      "í": 174,
      "î": 175,
      "ï": 176,
      "ð": 177,
      "ñ": 178,
      "ò": 179,
      "ó": 180,
      "ô": 181,
      "õ": 182,
      "ö": 183,
      "÷": 184,
      "ø": 185,
      "ù": 186,
      "ú": 187,
      "û": 188,
      "ü": 189,
      "ý": 190,
      "þ": 191,
      "ÿ": 192,
      "Ā": 193,
      "ā": 194,
      "Ă": 195,
      "ă": 196,
      "Ą": 197,
      "ą": 198,
      "Ć": 199,
      "ć": 200,
      "Ĉ": 201,
      "ĉ": 202,
      "Ċ": 203,
      "ċ": 204,
      "Č": 205,
      "č": 206,
      "Ď": 207,
      "ď": 208,
      "Đ": 209,
      "đ": 210,
      "Ē": 211,
      "ē": 212,
      "Ĕ": 213,
      "ĕ": 214,
      "Ė": 215,
      "ė": 216,
      "Ę": 217,
      "ę": 218,
      "Ě": 219,
      "ě": 220,
      "Ĝ": 221,
      "ĝ": 222,
      "Ğ": 223,
      "ğ": 224,
      "Ġ": 225,
      "ġ": 226,
      "Ģ": 227,
      "ģ": 228,
      "Ĥ": 229,
      "ĥ": 230,
      "Ħ": 231,
      "ħ": 232,
      "Ĩ": 233,
      "ĩ": 234,
      "Ī": 235,
      "ī": 236,
      "Ĭ": 237,
      "ĭ": 238,
      "Į": 239,
      "į": 240,
      "İ": 241,
      "ı": 242,
      "Ĳ": 243,
      "ĳ": 244,
      "Ĵ": 245,
      "ĵ": 246,
      "Ķ": 247,
      "ķ": 248,
      "ĸ": 249,
      "Ĺ": 250,
      "ĺ": 251,
      "Ļ": 252,
      "ļ": 253,
      "Ľ": 254,
      "ľ": 255,
      "Ŀ": 256,
      "ŀ": 257,
      "Ł": 258,
      "ł": 259,
      "Ń": 260,
      "cc": 261,
      "))": 262,
      "CC": 263,
      "))))": 264,
      "cccc": 265,
      "ccc": 266,
      "(=": 267,
      "čĊ": 268,
      "nc": 269,
      "))))))))": 270,
      "NC": 271,
      "CCC": 272,
      "))))))": 273,
      "@@": 274,
      "ccccc": 275,
      "OC": 276,
      ")[": 277,
      "CO": 278,
      "cccccc": 279,
      "CCCC": 280,
      "Cl": 281,
      "Cc": 282,
      "CN": 283,
      "](": 284,
      ")=": 285,
      "CCN": 286,
      "cn": 287,
      ")))))))": 288,
      "(-": 289,
      "nH": 290,
      "Nc": 291,
      ")(": 292,
      "10": 293,
      "CCO": 294,
      "))))))))))": 295,
      "ncc": 296,
      ")))))))))": 297,
      "COc": 298,
      "nn": 299,
      ")))))": 300,
      "NCC": 301,
      "CNC": 302,
      "cnc": 303,
      ")(=": 304,
      "+]": 305,
      "@]": 306,
      "12": 307,
      ")))": 308,
      "OCC": 309,
      "Ccccc": 310,
      "-]": 311,
      "COC": 312,
      "@@]": 313,
      "CCCCC": 314,
      "Br": 315,
      "sc": 316,
      "oc": 317,
      ")))))))))))": 318,
      "CCCN": 319,
      "ccccC": 320,
      "CCOCC": 321,
      "CCNC": 322,
      "Oc": 323,
      "ccn": 324,
      "CS": 325,
      "ccccCl": 326,
      "CCOC": 327,
      "ccnc": 328,
      "CF": 329,
      "NCCC": 330,
      "([": 331,
      "nnc": 332,
      "Ccccccc": 333,
      "CCc": 334,
      ")/": 335,
      "ccccF": 336,
      "NCCCC": 337,
      "21": 338,
      "))))))))))))": 339,
      "COcccc": 340,
      "cccnc": 341,
      "-])": 342,
      "(/": 343,
      "Cn": 344,
      "ncnc": 345,
      "23": 346,
      "NS": 347,
      "106": 348,
      "69": 349,
      "96": 350,
      "Cccc": 351,
      "CCCCCCCC": 352,
      "NCCN": 353,
      "Ncccc": 354,
      "NCc": 355,
      "cncc": 356,
      "cC": 357,
      ")))))))))))))": 358,
      "][": 359,
      "+]=": 360,
      "CCCNC": 361,
      "nccc": 362,
      "SC": 363,
      "ccccO": 364,
      "ccncc": 365,
      "+](=": 366,
      "COccc": 367,
      "cnn": 368,
      "13": 369,
      "ccC": 370,
      "Ncccccc": 371,
      "]%": 372,
      "ccccnc": 373,
      "CCCCCC": 374,
      "))))))))))))))": 375,
      "OCc": 376,
      "OCO": 377,
      "14": 378,
      "cs": 379,
      "32": 380,
      "CCCO": 381,
      "ncn": 382,
      "CCNCC": 383,
      "-]))": 384,
      "Nccc": 385,
      "no": 386,
      "cOC": 387,
      "COcccccc": 388,
      "ccccn": 389,
      "Cccccc": 390,
      "95": 391,
      "cCl": 392,
      "cnccc": 393,
      "CCOc": 394,
      "Ccc": 395,
      "ccccOC": 396,
      "CCS": 397,
      "cccccn": 398,
      "NCCOCC": 399,
      "cnnc": 400,
      "NCCNC": 401,
      "CNCC": 402,
      "cF": 403,
      "cO": 404,
      "+](": 405,
      "ccccNC": 406,
      "cccC": 407,
      "Ncnc": 408,
      ")))))))))))))))": 409,
      "NCCCCC": 410,
      "34": 411,
      "Nccccc": 412,
      "NO": 413,
      "noc": 414,
      "CCCCN": 415,
      "ncccc": 416,
      "))[": 417,
      "))))))))))))))))": 418,
      "cccncc": 419,
      "11": 420,
      "NCcccccc": 421,
      "csc": 422,
      "CCn": 423,
      "COccccc": 424,
      "OCCO": 425,
      "=[": 426,
      "cccCl": 427,
      "ccnn": 428,
      "ccccCF": 429,
      "cncccccc": 430,
      "cccccCl": 431,
      "NN": 432,
      "ccsc": 433,
      "SCC": 434,
      "cccn": 435,
      "))))))[": 436,
      "ccco": 437,
      "CCCCCCC": 438,
      "cccs": 439,
      "cncccc": 440,
      "COCC": 441,
      "ccO": 442,
      "NCCO": 443,
      "OCCN": 444,
      "CCcccccc": 445,
      "CSc": 446,
      "ccOC": 447,
      "ccCl": 448,
      "CNc": 449,
      "ccccs": 450,
      "Ccnc": 451,
      "cccF": 452,
      "ccF": 453,
      "cccco": 454,
      "NCCCN": 455,
      "ncccccc": 456,
      "CCCCNC": 457,
      "CCCc": 458,
      "cccO": 459,
      "ccccBr": 460,
      "CccccC": 461,
      "nnn": 462,
      "cncnc": 463,
      "OCcccccc": 464,
      "Occcccc": 465,
      "Sc": 466,
      "nccnc": 467,
      "COccccC": 468,
      "cccccC": 469,
      "on": 470,
      "CNCCC": 471,
      "Occcc": 472,
      ")))))))[": 473,
      "NNC": 474,
      "43": 475,
      "nC": 476,
      "Cnc": 477,
      "CcccC": 478,
      "OCCC": 479,
      "cccccF": 480,
      "CNCCCC": 481,
      "cccOC": 482,
      "CNCCN": 483,
      "cccNC": 484,
      "+][": 485,
      "nccn": 486,
      "+]([": 487,
      ")))))))))[": 488,
      ")))))))))))))))))": 489,
      ")))[": 490,
      "Ncncc": 491,
      "17": 492,
      "cccccccc": 493,
      "@]%": 494,
      "NCCCCCC": 495,
      "CccccCl": 496,
      ")-": 497,
      "NCCc": 498,
      "ccccS": 499,
      "))))))))[": 500,
      "Cncc": 501,
      "NccccF": 502,
      "(\\": 503,
      "@@](": 504,
      "CSC": 505,
      "OCCCC": 506,
      "COCCN": 507,
      "NccccC": 508,
      "@@]%": 509,
      "ccccccccc": 510,
      "ncccn": 511,
      "NccccCl": 512,
      "ncC": 513,
      "@](": 514,
      "))))))))))))))))))": 515,
      "CccccF": 516,
      "CNS": 517,
      "cccccCF": 518,
      "ncN": 519,
      "NCCCNC": 520,
      "cncn": 521,
      "CCCCO": 522,
      "CNCCCCC": 523,
      "cncC": 524,
      "CNCCNC": 525,
      "cnccn": 526,
      "cccccNC": 527,
      "CCl": 528,
      "CCCS": 529,
      "15": 530,
      "nccC": 531,
      "CccccO": 532,
      "Ncnccc": 533,
      "CCCNCC": 534,
      "OCF": 535,
      "CNcccccc": 536,
      "Ccnn": 537,
      "cccccO": 538,
      "ccoc": 539,
      "/[": 540,
      "Clc": 541,
      "co": 542,
      "COP": 543,
      "ccccCC": 544,
      "sccc": 545,
      "cnnn": 546,
      "NCCNCC": 547,
      "))))[": 548,
      "NCCcccccc": 549,
      "CccccNC": 550,
      "cnoc": 551,
      "59": 552,
      "Fc": 553,
      "CCCcccccc": 554,
      "Cccn": 555,
      "nccs": 556,
      "-%": 557,
      ")))))[": 558,
      "CccccS": 559,
      "CNCCO": 560,
      "ccccccc": 561,
      "ccnnC": 562,
      "cN": 563,
      "coc": 564,
      "]([": 565,
      "Ncn": 566,
      "CCCn": 567,
      "ncncc": 568,
      "cccsc": 569,
      "CCOcccccc": 570,
      ")))))))))))))))))))": 571,
      "OP": 572,
      "ccN": 573,
      "18": 574,
      "CCOcccc": 575,
      "COcccC": 576,
      "SCc": 577,
      "cccCF": 578,
      "ccCF": 579,
      "OCCCN": 580,
      "cccccccccc": 581,
      "OS": 582,
      "cCF": 583,
      "COccccNC": 584,
      "scc": 585,
      "NCCCO": 586,
      "ccccOCC": 587,
      "onc": 588,
      "CCCOc": 589,
      "Si": 590,
      "45": 591,
      "ccccOCF": 592,
      "CNCcccccc": 593,
      "Cccccnc": 594,
      "CCCOC": 595,
      "))=": 596,
      "-],": 597,
      "CCNc": 598,
      "COcccOC": 599
    },
    "merges": [
      [
        "c",
        "c"
      ],
      [
        ")",
        ")"
      ],
      [
        "C",
        "C"
      ],
      [
        "))",
        "))"
      ],
      [
        "cc",
        "cc"
      ],
      [
        "cc",
        "c"
      ],
      [
        "(",
        "="
      ],
      [
        "č",
        "Ċ"
      ],
      [
        "n",
        "c"
      ],
      [
        "))))",
        "))))"
      ],
      [
        "N",
        "C"
      ],
      [
        "CC",
        "C"
      ],
      [
        "))))",
        "))"
      ],
      [
        "@",
        "@"
      ],
      [
        "cccc",
        "c"
      ],
      [
        "O",
        "C"
      ],
      [
        ")",
        "["
      ],
      [
        "C",
        "O"
      ],
      [
        "cccc",
        "cc"
      ],
      [
        "CC",
        "CC"
      ],
      [
        "C",
        "l"
      ],
      [
        "C",
        "c"
      ],
      [
        "C",
        "N"
      ],
      [
        "]",
        "("
      ],
      [
        ")",
        "="
      ],
      [
        "CC",
        "N"
      ],
      [
        "c",
        "n"
      ],
      [
        "))))))",
        ")"
      ],
      [
        "(",
        "-"
      ],
      [
        "n",
        "H"
      ],
      [
        "N",
        "c"
      ],
      [
        ")",
        "("
      ],
      [
        "1",
        "0"
      ],
      [
        "CC",
        "O"
      ],
      [
        "))))))))",
        "))"
      ],
      [
        "n",
        "cc"
      ],
      [
        "))))))))",
        ")"
      ],
      [
        "CO",
        "c"
      ],
      [
        "n",
        "n"
      ],
      [
        "))))",
        ")"
      ],
      [
        "N",
        "CC"
      ],
      [
        "C",
        "NC"
      ],
      [
        "c",
        "nc"
      ],
      [
        ")",
        "(="
      ],
      [
        "+",
        "]"
      ],
      [
        "@",
        "]"
      ],
      [
        "1",
        "2"
      ],
      [
        "))",
        ")"
      ],
      [
        "O",
        "CC"
      ],
      [
        "C",
        "cccc"
      ],
      [
        "-",
        "]"
      ],
      [
        "C",
        "OC"
      ],
      [
        "@@",
        "]"
      ],
      [
        "CC",
        "CCC"
      ],
      [
        "B",
        "r"
      ],
      [
        "s",
        "c"
      ],
      [
        "o",
        "c"
      ],
      [
        "))))))))))",
        ")"
      ],
      [
        "CCC",
        "N"
      ],
      [
        "cccc",
        "C"
      ],
      [
        "CCO",
        "CC"
      ],
      [
        "CC",
        "NC"
      ],
      [
        "O",
        "c"
      ],
      [
        "cc",
        "n"
      ],
      [
        "C",
        "S"
      ],
      [
        "cccc",
        "Cl"
      ],
      [
        "CC",
        "OC"
      ],
      [
        "cc",
        "nc"
      ],
      [
        "C",
        "F"
      ],
      [
        "N",
        "CCC"
      ],
      [
        "(",
        "["
      ],
      [
        "n",
        "nc"
      ],
      [
        "C",
        "cccccc"
      ],
      [
        "CC",
        "c"
      ],
      [
        ")",
        "/"
      ],
      [
        "cccc",
        "F"
      ],
      [
        "N",
        "CCCC"
      ],
      [
        "2",
        "1"
      ],
      [
        "))))))))",
        "))))"
      ],
      [
        "CO",
        "cccc"
      ],
      [
        "ccc",
        "nc"
      ],
      [
        "-]",
        ")"
      ],
      [
        "(",
        "/"
      ],
      [
        "C",
        "n"
      ],
      [
        "nc",
        "nc"
      ],
      [
        "2",
        "3"
      ],
      [
        "N",
        "S"
      ],
      [
        "10",
        "6"
      ],
      [
        "6",
        "9"
      ],
      [
        "9",
        "6"
      ],
      [
        "C",
        "ccc"
      ],
      [
        "CCCC",
        "CCCC"
      ],
      [
        "N",
        "CCN"
      ],
      [
        "N",
        "cccc"
      ],
      [
        "NC",
        "c"
      ],
      [
        "cn",
        "cc"
      ],
      [
        "c",
        "C"
      ],
      [
        "))))))))",
        ")))))"
      ],
      [
        "]",
        "["
      ],
      [
        "+]",
        "="
      ],
      [
        "CCC",
        "NC"
      ],
      [
        "n",
        "ccc"
      ],
      [
        "S",
        "C"
      ],
      [
        "cccc",
        "O"
      ],
      [
        "cc",
        "ncc"
      ],
      [
        "+]",
        "(="
      ],
      [
        "CO",
        "ccc"
      ],
      [
        "cn",
        "n"
      ],
      [
        "1",
        "3"
      ],
      [
        "cc",
        "C"
      ],
      [
        "N",
        "cccccc"
      ],
      [
        "]",
        "%"
      ],
      [
        "cccc",
        "nc"
      ],
      [
        "CCCC",
        "CC"
      ],
      [
        "))))))))",
        "))))))"
      ],
      [
        "OC",
        "c"
      ],
      [
        "OC",
        "O"
      ],
      [
        "1",
        "4"
      ],
      [
        "c",
        "s"
      ],
      [
        "3",
        "2"
      ],
      [
        "CCC",
        "O"
      ],
      [
        "nc",
        "n"
      ],
      [
        "CCN",
        "CC"
      ],
      [
        "-]",
        "))"
      ],
      [
        "N",
        "ccc"
      ],
      [
        "n",
        "o"
      ],
      [
        "c",
        "OC"
      ],
      [
        "CO",
        "cccccc"
      ],
      [
        "cccc",
        "n"
      ],
      [
        "C",
        "ccccc"
      ],
      [
        "9",
        "5"
      ],
      [
        "c",
        "Cl"
      ],
      [
        "cn",
        "ccc"
      ],
      [
        "CCO",
        "c"
      ],
      [
        "C",
        "cc"
      ],
      [
        "cccc",
        "OC"
      ],
      [
        "CC",
        "S"
      ],
      [
        "ccccc",
        "n"
      ],
      [
        "N",
        "CCOCC"
      ],
      [
        "cn",
        "nc"
      ],
      [
        "NCC",
        "NC"
      ],
      [
        "CN",
        "CC"
      ],
      [
        "c",
        "F"
      ],
      [
        "c",
        "O"
      ],
      [
        "+",
        "]("
      ],
      [
        "cccc",
        "NC"
      ],
      [
        "ccc",
        "C"
      ],
      [
        "Nc",
        "nc"
      ],
      [
        "))))))))",
        ")))))))"
      ],
      [
        "NCC",
        "CCC"
      ],
      [
        "3",
        "4"
      ],
      [
        "N",
        "ccccc"
      ],
      [
        "N",
        "O"
      ],
      [
        "n",
        "oc"
      ],
      [
        "CCCC",
        "N"
      ],
      [
        "n",
        "cccc"
      ],
      [
        "))",
        "["
      ],
      [
        "))))))))",
        "))))))))"
      ],
      [
        "ccc",
        "ncc"
      ],
      [
        "1",
        "1"
      ],
      [
        "NC",
        "cccccc"
      ],
      [
        "c",
        "sc"
      ],
      [
        "CC",
        "n"
      ],
      [
        "CO",
        "ccccc"
      ],
      [
        "O",
        "CCO"
      ],
      [
        "=",
        "["
      ],
      [
        "ccc",
        "Cl"
      ],
      [
        "cc",
        "nn"
      ],
      [
        "ccccC",
        "F"
      ],
      [
        "cn",
        "cccccc"
      ],
      [
        "ccccc",
        "Cl"
      ],
      [
        "N",
        "N"
      ],
      [
        "cc",
        "sc"
      ],
      [
        "S",
        "CC"
      ],
      [
        "ccc",
        "n"
      ],
      [
        "))))))",
        "["
      ],
      [
        "ccc",
        "o"
      ],
      [
        "CCCC",
        "CCC"
      ],
      [
        "ccc",
        "s"
      ],
      [
        "cn",
        "cccc"
      ],
      [
        "CO",
        "CC"
      ],
      [
        "cc",
        "O"
      ],
      [
        "N",
        "CCO"
      ],
      [
        "O",
        "CCN"
      ],
      [
        "CC",
        "cccccc"
      ],
      [
        "CS",
        "c"
      ],
      [
        "cc",
        "OC"
      ],
      [
        "cc",
        "Cl"
      ],
      [
        "CN",
        "c"
      ],
      [
        "cccc",
        "s"
      ],
      [
        "Cc",
        "nc"
      ],
      [
        "ccc",
        "F"
      ],
      [
        "cc",
        "F"
      ],
      [
        "cccc",
        "o"
      ],
      [
        "N",
        "CCCN"
      ],
      [
        "n",
        "cccccc"
      ],
      [
        "CCCC",
        "NC"
      ],
      [
        "CCC",
        "c"
      ],
      [
        "ccc",
        "O"
      ],
      [
        "cccc",
        "Br"
      ],
      [
        "Ccccc",
        "C"
      ],
      [
        "nn",
        "n"
      ],
      [
        "cnc",
        "nc"
      ],
      [
        "OC",
        "cccccc"
      ],
      [
        "O",
        "cccccc"
      ],
      [
        "S",
        "c"
      ],
      [
        "ncc",
        "nc"
      ],
      [
        "CO",
        "ccccC"
      ],
      [
        "ccccc",
        "C"
      ],
      [
        "o",
        "n"
      ],
      [
        "CN",
        "CCC"
      ],
      [
        "O",
        "cccc"
      ],
      [
        "))))))",
        ")["
      ],
      [
        "N",
        "NC"
      ],
      [
        "4",
        "3"
      ],
      [
        "n",
        "C"
      ],
      [
        "C",
        "nc"
      ],
      [
        "Cccc",
        "C"
      ],
      [
        "O",
        "CCC"
      ],
      [
        "ccccc",
        "F"
      ],
      [
        "CN",
        "CCCC"
      ],
      [
        "ccc",
        "OC"
      ],
      [
        "CN",
        "CCN"
      ],
      [
        "ccc",
        "NC"
      ],
      [
        "+]",
        "["
      ],
      [
        "ncc",
        "n"
      ],
      [
        "+](",
        "["
      ],
      [
        "))))))))",
        ")["
      ],
      [
        "))))))))",
        ")))))))))"
      ],
      [
        "))",
        ")["
      ],
      [
        "N",
        "cncc"
      ],
      [
        "1",
        "7"
      ],
      [
        "cccc",
        "cccc"
      ],
      [
        "@]",
        "%"
      ],
      [
        "NCCCC",
        "CC"
      ],
      [
        "Ccccc",
        "Cl"
      ],
      [
        ")",
        "-"
      ],
      [
        "NCC",
        "c"
      ],
      [
        "cccc",
        "S"
      ],
      [
        "))))))))",
        "["
      ],
      [
        "C",
        "ncc"
      ],
      [
        "N",
        "ccccF"
      ],
      [
        "(",
        "\\"
      ],
      [
        "@@",
        "]("
      ],
      [
        "CS",
        "C"
      ],
      [
        "O",
        "CCCC"
      ],
      [
        "CO",
        "CCN"
      ],
      [
        "N",
        "ccccC"
      ],
      [
        "@@]",
        "%"
      ],
      [
        "cccc",
        "ccccc"
      ],
      [
        "nccc",
        "n"
      ],
      [
        "N",
        "ccccCl"
      ],
      [
        "nc",
        "C"
      ],
      [
        "@",
        "]("
      ],
      [
        "))))))))",
        "))))))))))"
      ],
      [
        "Ccccc",
        "F"
      ],
      [
        "CN",
        "S"
      ],
      [
        "ccccc",
        "CF"
      ],
      [
        "nc",
        "N"
      ],
      [
        "NCCC",
        "NC"
      ],
      [
        "cnc",
        "n"
      ],
      [
        "CCCC",
        "O"
      ],
      [
        "CN",
        "CCCCC"
      ],
      [
        "cnc",
        "C"
      ],
      [
        "CN",
        "CCNC"
      ],
      [
        "cn",
        "ccn"
      ],
      [
        "ccccc",
        "NC"
      ],
      [
        "CC",
        "l"
      ],
      [
        "CCC",
        "S"
      ],
      [
        "1",
        "5"
      ],
      [
        "ncc",
        "C"
      ],
      [
        "Ccccc",
        "O"
      ],
      [
        "N",
        "cnccc"
      ],
      [
        "CCC",
        "NCC"
      ],
      [
        "OC",
        "F"
      ],
      [
        "CN",
        "cccccc"
      ],
      [
        "Cc",
        "nn"
      ],
      [
        "ccccc",
        "O"
      ],
      [
        "cc",
        "oc"
      ],
      [
        "/",
        "["
      ],
      [
        "Cl",
        "c"
      ],
      [
        "c",
        "o"
      ],
      [
        "CO",
        "P"
      ],
      [
        "cccc",
        "CC"
      ],
      [
        "s",
        "ccc"
      ],
      [
        "cn",
        "nn"
      ],
      [
        "NCCN",
        "CC"
      ],
      [
        "))))",
        "["
      ],
      [
        "NCC",
        "cccccc"
      ],
      [
        "Ccccc",
        "NC"
      ],
      [
        "cn",
        "oc"
      ],
      [
        "5",
        "9"
      ],
      [
        "F",
        "c"
      ],
      [
        "CCC",
        "cccccc"
      ],
      [
        "C",
        "ccn"
      ],
      [
        "ncc",
        "s"
      ],
      [
        "-",
        "%"
      ],
      [
        "))))",
        ")["
      ],
      [
        "Ccccc",
        "S"
      ],
      [
        "CN",
        "CCO"
      ],
      [
        "cccc",
        "ccc"
      ],
      [
        "ccnn",
        "C"
      ],
      [
        "c",
        "N"
      ],
      [
        "c",
        "oc"
      ],
      [
        "](",
        "["
      ],
      [
        "N",
        "cn"
      ],
      [
        "CCC",
        "n"
      ],
      [
        "nc",
        "ncc"
      ],
      [
        "ccc",
        "sc"
      ],
      [
        "CCO",
        "cccccc"
      ],
      [
        "))))))))",
        ")))))))))))"
      ],
      [
        "O",
        "P"
      ],
      [
        "cc",
        "N"
      ],
      [
        "1",
        "8"
      ],
      [
        "CCO",
        "cccc"
      ],
      [
        "COccc",
        "C"
      ],
      [
        "S",
        "Cc"
      ],
      [
        "ccc",
        "CF"
      ],
      [
        "cc",
        "CF"
      ],
      [
        "O",
        "CCCN"
      ],
      [
        "cccc",
        "cccccc"
      ],
      [
        "O",
        "S"
      ],
      [
        "c",
        "CF"
      ],
      [
        "COcccc",
        "NC"
      ],
      [
        "s",
        "cc"
      ],
      [
        "NCCC",
        "O"
      ],
      [
        "cccc",
        "OCC"
      ],
      [
        "o",
        "nc"
      ],
      [
        "CCC",
        "Oc"
      ],
      [
        "S",
        "i"
      ],
      [
        "4",
        "5"
      ],
      [
        "ccccOC",
        "F"
      ],
      [
        "CNC",
        "cccccc"
      ],
      [
        "Ccccc",
        "nc"
      ],
      [
        "CCC",
        "OC"
      ],
      [
        "))",
        "="
      ],
      [
        "-]",
        ","
      ],
      [
        "CCN",
        "c"
      ],
      [
        "COccc",
        "OC"
      ]
    ]
  }
}