{
  "!": 5,
  "\"": 6,
  "#": 7,
  "$": 8,
  "%": 9,
  "&": 10,
  "'": 11,
  "(": 12,
  "(#": 712,
  "(-": 283,
  "(-[": 602,
  "(/": 324,
  "(/[": 530,
  "(=": 263,
  "(=[": 467,
  "([": 284,
  "(\\": 381,
  "(\\[": 438,
  ")": 13,
  ")(": 281,
  ")(/": 514,
  ")(=": 287,
  ")([": 388,
  ")-": 497,
  ")/": 339,
  ")/[": 622,
  ")=": 295,
  ")=[": 427,
  ")[": 272,
  ")\\": 551,
  "*": 14,
  "+": 15,
  "+]": 274,
  "+](": 293,
  "+](-": 701,
  "+](/": 743,
  "+](/[": 744,
  "+](=": 306,
  "+]([": 368,
  "+])": 337,
  "+])(": 448,
  "+])([": 522,
  "+])[": 413,
  "+]/": 504,
  "+]=": 374,
  "+]=[": 600,
  "+][": 314,
  "+]\\": 489,
  ",": 16,
  "-": 17,
  "-[": 713,
  "-]": 288,
  "-])": 292,
  "-])(": 571,
  "-])([": 697,
  "-])/": 490,
  "-])=": 402,
  "-])=[": 572,
  "-])[": 372,
  "-])\\": 742,
  "-]/": 618,
  "-]=[": 649,
  "-][": 588,
  ".": 18,
  "/": 19,
  "/[": 403,
  "0": 20,
  "1": 21,
  "12": 304,
  "123": 750,
  "13": 435,
  "2": 22,
  "21": 309,
  "23": 335,
  "24": 521,
  "3": 23,
  "31": 469,
  "312": 714,
  "32": 333,
  "34": 383,
  "35": 644,
  "4": 24,
  "41": 679,
  "42": 543,
  "43": 396,
  "45": 510,
  "5": 25,
  "54": 531,
  "6": 26,
  "7": 27,
  "8": 28,
  "9": 29,
  ":": 30,
  ";": 31,
  "<": 32,
  "</s>": 2,
  "<mask>": 4,
  "<pad>": 1,
  "<s>": 0,
  "<unk>": 3,
  "=": 33,
  "=[": 361,
  ">": 34,
  "?": 35,
  "@": 36,
  "@@": 266,
  "@@]": 329,
  "@@](": 358,
  "@@](=": 394,
  "@@]([": 517,
  "@]": 326,
  "@](": 354,
  "@](=": 404,
  "@]([": 508,
  "A": 37,
  "B": 38,
  "Br": 299,
  "BrCC": 748,
  "BrCCC": 749,
  "BrCc": 642,
  "Brc": 458,
  "C": 39,
  "CBr": 509,
  "CC": 262,
  "CCBr": 613,
  "CCC": 271,
  "CCCBr": 729,
  "CCCC": 285,
  "CCCCC": 305,
  "CCCCCC": 365,
  "CCCCCCC": 433,
  "CCCCCCCC": 693,
  "CCCCCCCCCCC": 670,
  "CCCCCCN": 736,
  "CCCCCCNC": 639,
  "CCCCCCO": 694,
  "CCCCCCS": 695,
  "CCCCCN": 494,
  "CCCCCNC": 529,
  "CCCCCO": 604,
  "CCCCCOC": 751,
  "CCCCCOc": 752,
  "CCCCCS": 632,
  "CCCCCSc": 753,
  "CCCCCc": 617,
  "CCCCCn": 565,
  "CCCCN": 369,
  "CCCCNC": 429,
  "CCCCNS": 758,
  "CCCCNc": 582,
  "CCCCO": 414,
  "CCCCOC": 535,
  "CCCCOCC": 638,
  "CCCCOCc": 738,
  "CCCCOc": 492,
  "CCCCS": 485,
  "CCCCSC": 737,
  "CCCCSc": 577,
  "CCCCc": 450,
  "CCCCl": 558,
  "CCCCn": 444,
  "CCCF": 555,
  "CCCN": 310,
  "CCCNC": 370,
  "CCCNCC": 704,
  "CCCNCc": 730,
  "CCCNS": 556,
  "CCCNc": 453,
  "CCCO": 325,
  "CCCOC": 428,
  "CCCOCC": 526,
  "CCCOCc": 674,
  "CCCOc": 390,
  "CCCS": 400,
  "CCCSC": 520,
  "CCCSCC": 505,
  "CCCSCc": 690,
  "CCCSc": 488,
  "CCCc": 344,
  "CCCl": 479,
  "CCCn": 376,
  "CCN": 280,
  "CCNC": 332,
  "CCNCC": 527,
  "CCNCc": 545,
  "CCNS": 425,
  "CCNc": 417,
  "CCO": 289,
  "CCOC": 313,
  "CCOCC": 315,
  "CCOCCC": 579,
  "CCOCCCC": 603,
  "CCOCCCN": 698,
  "CCOCCCNC": 568,
  "CCOCCCNc": 699,
  "CCOCCCc": 672,
  "CCOCCCn": 740,
  "CCOCCN": 501,
  "CCOCCNC": 589,
  "CCOCCNc": 706,
  "CCOCCO": 559,
  "CCOCCOC": 671,
  "CCOCCOCC": 739,
  "CCOCCOCCOCC": 765,
  "CCOCCOCc": 700,
  "CCOCCOc": 631,
  "CCOCCS": 605,
  "CCOCCSc": 754,
  "CCOCCn": 606,
  "CCOCc": 473,
  "CCONC": 583,
  "CCOP": 650,
  "CCOc": 319,
  "CCS": 317,
  "CCSC": 395,
  "CCSCC": 399,
  "CCSCCC": 607,
  "CCSCCOC": 708,
  "CCSCCOc": 755,
  "CCSCc": 538,
  "CCSS": 707,
  "CCSc": 379,
  "CCc": 294,
  "CCl": 416,
  "CCn": 331,
  "CH": 680,
  "CI": 657,
  "CN": 286,
  "CNC": 300,
  "CNCC": 567,
  "CNCCC": 696,
  "CNCCN": 587,
  "CNCCc": 564,
  "CNCc": 463,
  "CNN": 586,
  "CNS": 393,
  "CNc": 359,
  "CNn": 578,
  "CO": 275,
  "COC": 307,
  "COCC": 382,
  "COCCC": 477,
  "COCCCC": 533,
  "COCCCCC": 692,
  "COCCCCN": 731,
  "COCCCN": 495,
  "COCCCNC": 482,
  "COCCCNc": 630,
  "COCCCOC": 637,
  "COCCCOc": 626,
  "COCCCS": 732,
  "COCCCn": 566,
  "COCCN": 397,
  "COCCNC": 442,
  "COCCNCc": 759,
  "COCCNS": 623,
  "COCCNc": 608,
  "COCCO": 461,
  "COCCOC": 542,
  "COCCOCC": 614,
  "COCCOCCN": 763,
  "COCCOCCNC": 734,
  "COCCOc": 468,
  "COCCS": 629,
  "COCCSCc": 733,
  "COCCSc": 615,
  "COCCc": 518,
  "COCCn": 430,
  "COCO": 585,
  "COCOc": 669,
  "COCc": 386,
  "CON": 500,
  "CONC": 540,
  "COP": 647,
  "COS": 691,
  "COc": 282,
  "COn": 636,
  "CS": 297,
  "CSC": 375,
  "CSCC": 407,
  "CSCCC": 515,
  "CSCCCC": 745,
  "CSCCCCNC": 651,
  "CSCCCN": 627,
  "CSCCCNC": 619,
  "CSCCCNc": 747,
  "CSCCN": 536,
  "CSCCNC": 596,
  "CSCCO": 496,
  "CSCCOC": 746,
  "CSCCOc": 702,
  "CSCCS": 481,
  "CSCCSC": 703,
  "CSCCc": 640,
  "CSCCn": 641,
  "CSCN": 491,
  "CSCc": 419,
  "CSc": 327,
  "Cc": 267,
  "Cl": 278,
  "ClC": 570,
  "ClCC": 648,
  "ClCCCSc": 735,
  "ClCc": 616,
  "Clc": 418,
  "Cn": 308,
  "D": 40,
  "E": 41,
  "F": 42,
  "FC": 432,
  "FCCC": 715,
  "Fc": 398,
  "G": 43,
  "H": 44,
  "I": 45,
  "IC": 716,
  "Ic": 717,
  "J": 46,
  "K": 47,
  "L": 48,
  "M": 49,
  "N": 50,
  "NC": 268,
  "NCC": 322,
  "NCCC": 366,
  "NCCCC": 466,
  "NCCCCC": 592,
  "NCCCCCC": 658,
  "NCCCCN": 628,
  "NCCCCOc": 678,
  "NCCCCl": 677,
  "NCCCCn": 552,
  "NCCCN": 456,
  "NCCCNC": 569,
  "NCCCNS": 643,
  "NCCCNc": 654,
  "NCCCO": 502,
  "NCCCOC": 560,
  "NCCCOCC": 675,
  "NCCCOc": 591,
  "NCCCS": 590,
  "NCCCSC": 757,
  "NCCCSc": 580,
  "NCCCc": 449,
  "NCCCn": 447,
  "NCCN": 411,
  "NCCNC": 422,
  "NCCNS": 609,
  "NCCNc": 478,
  "NCCO": 487,
  "NCCOC": 534,
  "NCCOCC": 546,
  "NCCOCCO": 764,
  "NCCOCc": 660,
  "NCCOc": 443,
  "NCCS": 459,
  "NCCSC": 633,
  "NCCSCC": 659,
  "NCCSCc": 711,
  "NCCSc": 525,
  "NCCc": 357,
  "NCCn": 446,
  "NCN": 576,
  "NCc": 302,
  "NH": 273,
  "NN": 364,
  "NNC": 352,
  "NNN": 756,
  "NNS": 547,
  "NNc": 409,
  "NO": 436,
  "NOC": 584,
  "NOCC": 597,
  "NOCCc": 762,
  "NOCc": 549,
  "NOc": 718,
  "NS": 356,
  "NSC": 681,
  "Nc": 277,
  "Nn": 455,
  "O": 51,
  "OC": 279,
  "OCC": 323,
  "OCCBr": 710,
  "OCCC": 426,
  "OCCCC": 512,
  "OCCCCC": 661,
  "OCCCCN": 673,
  "OCCCCn": 721,
  "OCCCN": 548,
  "OCCCNC": 553,
  "OCCCNc": 760,
  "OCCCO": 420,
  "OCCCOc": 624,
  "OCCCS": 686,
  "OCCCSC": 761,
  "OCCCSc": 656,
  "OCCCc": 550,
  "OCCCl": 655,
  "OCCCn": 598,
  "OCCF": 709,
  "OCCN": 439,
  "OCCNC": 486,
  "OCCNS": 662,
  "OCCNc": 557,
  "OCCO": 360,
  "OCCOC": 573,
  "OCCOCC": 684,
  "OCCOCCOCCO": 653,
  "OCCOCCOCCOCCO": 766,
  "OCCOCCS": 722,
  "OCCOc": 498,
  "OCCS": 561,
  "OCCSC": 720,
  "OCCSCC": 685,
  "OCCSCc": 663,
  "OCCSc": 593,
  "OCCc": 472,
  "OCCn": 506,
  "OCN": 601,
  "OCO": 353,
  "OCOC": 523,
  "OCc": 349,
  "OCn": 595,
  "OH": 682,
  "ON": 519,
  "ONC": 719,
  "OP": 634,
  "OS": 474,
  "Oc": 312,
  "On": 683,
  "P": 52,
  "Q": 53,
  "R": 54,
  "S": 55,
  "SC": 348,
  "SCC": 346,
  "SCCC": 460,
  "SCCCC": 635,
  "SCCCO": 725,
  "SCCCOc": 667,
  "SCCCS": 610,
  "SCCCc": 688,
  "SCCN": 503,
  "SCCNC": 666,
  "SCCO": 581,
  "SCCOC": 724,
  "SCCOc": 554,
  "SCCS": 562,
  "SCCSc": 726,
  "SCCc": 483,
  "SCCn": 645,
  "SCN": 664,
  "SCc": 378,
  "SCn": 665,
  "SH": 723,
  "SN": 687,
  "Sc": 345,
  "T": 56,
  "U": 57,
  "V": 58,
  "W": 59,
  "X": 60,
  "Y": 61,
  "Z": 62,
  "[": 63,
  "\\": 64,
  "\\[": 493,
  "]": 65,
  "](": 265,
  "](/": 513,
  "](/[": 689,
  "]([": 318,
  "]/": 594,
  "][": 625,
  "^": 66,
  "_": 67,
  "`": 68,
  "a": 69,
  "b": 70,
  "c": 71,
  "cc": 261,
  "ccc": 264,
  "cccc": 276,
  "ccccc": 269,
  "ccccn": 334,
  "cccn": 343,
  "cccnc": 321,
  "cccnn": 499,
  "ccco": 328,
  "cccs": 320,
  "ccn": 351,
  "ccnc": 347,
  "ccncc": 342,
  "ccncn": 524,
  "ccnn": 392,
  "ccnnc": 612,
  "ccno": 511,
  "ccoc": 387,
  "ccon": 451,
  "ccs": 599,
  "ccsc": 350,
  "cn": 311,
  "cnc": 316,
  "cncc": 363,
  "cnccc": 437,
  "cnccn": 401,
  "cncn": 380,
  "cncnc": 476,
  "cnco": 620,
  "cncs": 575,
  "cnn": 330,
  "cnnc": 406,
  "cnnn": 421,
  "cnns": 621,
  "cnoc": 574,
  "cnsc": 705,
  "cnsn": 652,
  "co": 484,
  "coc": 405,
  "conc": 668,
  "cs": 341,
  "csc": 340,
  "cscc": 434,
  "cscn": 445,
  "csnn": 507,
  "d": 72,
  "e": 73,
  "f": 74,
  "g": 75,
  "h": 76,
  "i": 77,
  "j": 78,
  "k": 79,
  "l": 80,
  "m": 81,
  "n": 82,
  "nH": 290,
  "nc": 270,
  "ncc": 298,
  "nccc": 385,
  "ncccc": 362,
  "ncccn": 391,
  "nccn": 389,
  "nccnc": 431,
  "ncco": 537,
  "nccs": 373,
  "ncn": 371,
  "ncnc": 355,
  "ncncc": 544,
  "ncnn": 415,
  "ncoc": 475,
  "ncon": 532,
  "ncsc": 454,
  "nn": 291,
  "nnc": 301,
  "nncc": 528,
  "nnccc": 741,
  "nncn": 412,
  "nnco": 539,
  "nncs": 462,
  "nnn": 408,
  "nnnc": 410,
  "nnnn": 384,
  "nnsc": 480,
  "no": 336,
  "noc": 338,
  "nonc": 457,
  "ns": 440,
  "nsc": 441,
  "nscc": 676,
  "nsnc": 471,
  "o": 83,
  "oc": 303,
  "occ": 563,
  "occc": 423,
  "ocnc": 470,
  "on": 367,
  "onc": 424,
  "oncc": 646,
  "p": 84,
  "q": 85,
  "r": 86,
  "s": 87,
  "sc": 296,
  "scc": 464,
  "sccc": 377,
  "sccn": 465,
  "scnc": 452,
  "sn": 611,
  "snc": 516,
  "snnc": 541,
  "ssc": 727,
  "ssnc": 728,
  "t": 88,
  "u": 89,
  "v": 90,
  "w": 91,
  "x": 92,
  "y": 93,
  "z": 94,
  "{": 95,
  "|": 96,
  "}": 97,
  "~": 98,
  "¡": 99,
  "¢": 100,
  "£": 101,
  "¤": 102,
  "¥": 103,
  "¦": 104,
  "§": 105,
  "¨": 106,
  "©": 107,
  "ª": 108,
  "«": 109,
  "¬": 110,
  "®": 111,
  "¯": 112,
  "°": 113,
  "±": 114,
  "²": 115,
  "³": 116,
  "´": 117,
  "µ": 118,
  "¶": 119,
  "·": 120,
  "¸": 121,
  "¹": 122,
  "º": 123,
  "»": 124,
  "¼": 125,
  "½": 126,
  "¾": 127,
  "¿": 128,
  "À": 129,
  "Á": 130,
  "Â": 131,
  "Ã": 132,
  "Ä": 133,
  "Å": 134,
  "Æ": 135,
  "Ç": 136,
  "È": 137,
  "É": 138,
  "Ê": 139,
  "Ë": 140,
  "Ì": 141,
  "Í": 142,
  "Î": 143,
  "Ï": 144,
  "Ð": 145,
  "Ñ": 146,
  "Ò": 147,
  "Ó": 148,
  "Ô": 149,
  "Õ": 150,
  "Ö": 151,
  "×": 152,
  "Ø": 153,
  "Ù": 154,
  "Ú": 155,
  "Û": 156,
  "Ü": 157,
  "Ý": 158,
  "Þ": 159,
  "ß": 160,
  "à": 161,
  "á": 162,
  "â": 163,
  "ã": 164,
  "ä": 165,
  "å": 166,
  "æ": 167,
  "ç": 168,
  "è": 169,
  "é": 170,
  "ê": 171,
  "ë": 172,
  "ì": 173,
  "í": 174,
  "î": 175,
  "ï": 176,
  "ð": 177,
  "ñ": 178,
  "ò": 179,
  "ó": 180,
  "ô": 181,
  "õ": 182,
  "ö": 183,
  "÷": 184,
  "ø": 185,
  "ù": 186,
  "ú": 187,
  "û": 188,
  "ü": 189,
  "ý": 190,
  "þ": 191,
  "ÿ": 192,
  "Ā": 193,
  "ā": 194,
  "Ă": 195,
  "ă": 196,
  "Ą": 197,
  "ą": 198,
  "Ć": 199,
  "ć": 200,
  "Ĉ": 201,
  "ĉ": 202,
  "Ċ": 203,
  "ċ": 204,
  "Č": 205,
  "č": 206,
  "Ď": 207,
  "ď": 208,
  "Đ": 209,
  "đ": 210,
  "Ē": 211,
  "ē": 212,
  "Ĕ": 213,
  "ĕ": 214,
  "Ė": 215,
  "ė": 216,
  "Ę": 217,
  "ę": 218,
  "Ě": 219,
  "ě": 220,
  "Ĝ": 221,
  "ĝ": 222,
  "Ğ": 223,
  "ğ": 224,
  "Ġ": 225,
  "ġ": 226,
  "Ģ": 227,
  "ģ": 228,
  "Ĥ": 229,
  "ĥ": 230,
  "Ħ": 231,
  "ħ": 232,
  "Ĩ": 233,
  "ĩ": 234,
  "Ī": 235,
  "ī": 236,
  "Ĭ": 237,
  "ĭ": 238,
  "Į": 239,
  "į": 240,
  "İ": 241,
  "ı": 242,
  "Ĳ": 243,
  "ĳ": 244,
  "Ĵ": 245,
  "ĵ": 246,
  "Ķ": 247,
  "ķ": 248,
  "ĸ": 249,
  "Ĺ": 250,
  "ĺ": 251,
  "Ļ": 252,
  "ļ": 253,
  "Ľ": 254,
  "ľ": 255,
  "Ŀ": 256,
  "ŀ": 257,
  "Ł": 258,
  "ł": 259,
  "Ń": 260
}
